Public Member Functions | List of all members
API_IEventHandler Class Referenceabstract
Notifications Manager
Defining an interface for all event handlers. More...
#include <APIdefs_Callback.h>
 Inheritance diagram for API_IEventHandler:
 Public Member Functions
virtual  | ~API_IEventHandler ()=default
virtual GS::UniString  | GetName () const =0
virtual void  | Dispatch (const API_IEventNotifier &eventNotfier) const =0
Detailed Description
Defining an interface for all event handlers.
Since
Archicad 26
Constructor & Destructor Documentation
◆ ~API_IEventHandler()
 virtual API_IEventHandler::~API_IEventHandler  |  ( |   | )
virtualdefault
Member Function Documentation
◆ Dispatch()
 virtual void API_IEventHandler::Dispatch  |  ( |  const API_IEventNotifier &  |  eventNotfier | ) |   const
pure virtual
Implemented in API_IAttributeEventHandler, API_IAttributeFolderEventHandler, API_IClassificationSystemEventHandler, API_IClassificationItemEventHandler, API_IPropertyGroupEventHandler, API_IPropertyDefinitionEventHandler, API_IGraphisoftIDEventHandler, API_IEnableAllInfoDialogEventHandler, and API_IMarqueeEventHandler.
◆ GetName()
 virtual GS::UniString API_IEventHandler::GetName  |  ( |   | ) |   const
pure virtual
Implemented in API_IAttributeEventHandler, API_IAttributeFolderEventHandler, API_IClassificationSystemEventHandler, API_IClassificationItemEventHandler, API_IPropertyGroupEventHandler, API_IPropertyDefinitionEventHandler, API_IGraphisoftIDEventHandler, API_IEnableAllInfoDialogEventHandler, and API_IMarqueeEventHandler.